# ========= Base Clock Definition =========
create_clock -name clk_main -period 10.000 [get_ports clk]

# ========= Clock Quality/Guardbands =========
set_clock_uncertainty -setup 0.20 -from [get_clocks clk_main] -to [get_clocks clk_main]
set_clock_uncertainty -hold  0.05 -from [get_clocks clk_main] -to [get_clocks clk_main]

# ========= Asynchronous Reset =========
set_false_path -from [get_ports reset_n]


set_false_path -through [get_nets -hierarchical *u_slow*|slow1*]
set_false_path -through [get_nets -hierarchical *u_slow*|slow2*]
set_false_path -through [get_nets -hierarchical *u_slow*|slow3*]